{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence file documenting a domain‑slug update and associated components.",
  "frontend-file-summaries.txt": "Prewritten summaries for major frontend files used for reference.",
  "frontend/index.css": "Tailwind base styles defining extensive OKLCH color variables for light and dark modes.",
  "frontend/index.html": "App entry HTML with domain‑slug meta tag and script bootstrapping the React app.",
  "frontend/src/App.tsx": "Root component rendering the IP lookup page and toast notifications.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor based on Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useIpLookup.ts": "React Query mutation wrapping fetchIpInfo for on‑demand IP or domain lookups.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder noting no backend queries are required.",
  "frontend/src/hooks/useVisitorIp.ts": "React Query hook fetching the visitor's own IP with optional details.",
  "frontend/src/index.css": "Tailwind styles with custom warm color tokens and dark‑mode variants plus utility extensions.",
  "frontend/src/lib/ipLookup.ts": "Validation helpers for IP/domain inputs and a fetcher for ipapi.co with error handling.",
  "frontend/src/main.tsx": "React app bootstrap with QueryClient and Internet Identity provider setup.",
  "frontend/src/pages/IpLookupPage.tsx": "Full IP lookup UI with visitor IP display, lookup form, toggleable details, and loading/error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, typography, container settings, animations, and extended theme utilities.",
  "project_state.json": "Project state metadata describing versions, deployment slug issues, and existing feature requirements for the app named 'ip look up'."
}